---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.RadialDimensionCannotProjectToArc
source: html/ea7b6fd4-f10b-c437-7d7a-45707b79ebd7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.RadialDimensionCannotProjectToArc Property

Cannot form radial dimension.

## Syntax (C#)
```csharp
public static FailureDefinitionId RadialDimensionCannotProjectToArc { get; }
```